Ran Plan for 3 projects:

1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
---

### 1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs_service.aws_ecs_service.this has changed
~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 0
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-api-prod"
        name                               = "marketplace-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 0 -> 1
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-api-prod"
        name                               = "marketplace-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ cpu                      = "512" -> "1024" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-prod" -> (known after apply)
      ~ memory                   = "1024" -> "2048" # forces replacement
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:1" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 2. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/16/default/terraform/environments/stage/ecs-web-api": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_logs...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_execution_role...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_role...
╷
│ Error: Failed to update module manifest
│ 
│ Unable to write the module manifest file: open
│ .terraform/modules/modules.json: no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 129:
│  129: module "web_api_logs" {
│ 
│ Could not download module "web_api_logs" (main.tf:129) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: fatal: could not create leading directories
│ of '.terraform/modules/web_api_logs': No such file or directory
│ 
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 148:
│  148: module "ecs_security_group" {
│ 
│ Could not download module "ecs_security_group" (main.tf:148) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: fatal: could not create leading directories
│ of '.terraform/modules/ecs_security_group': No such file or directory
│ 
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 198:
│  198: module "web_api_task_execution_role" {
│ 
│ Could not download module "web_api_task_execution_role" (main.tf:198)
│ source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: fatal: could not create leading directories
│ of '.terraform/modules/web_api_task_execution_role': No such file or
│ directory
│ 
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 265:
│  265: module "web_api_task_role" {
│ 
│ Could not download module "web_api_task_role" (main.tf:265) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: fatal: could not create leading directories
│ of '.terraform/modules/web_api_task_role': No such file or directory
│ 
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 387:
│  387: module "adot_sidecar" {
│ 
│ Could not download module "adot_sidecar" (main.tf:387) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: Cloning into
│ '.terraform/modules/adot_sidecar'...
│ error: could not lock config file
│ /home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/16/default/terraform/environments/stage/ecs-web-api/.terraform/modules/adot_sidecar/.git/config:
│ No such file or directory
│ fatal: could not set 'core.repositoryformatversion' to '0'
│ 
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 406:
│  406: module "ecs_service" {
│ 
│ Could not download module "ecs_service" (main.tf:406) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": error
│ downloading 'https://github.com/ryu-qqq/Infrastructure.git?ref=main':
│ /usr/bin/git exited with 128: fatal: could not create leading directories
│ of '.terraform/modules/ecs_service': No such file or directory
│ 
╵


```
</details>

---
### 3. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.intelligence_aggregation_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "intelligence_aggregation_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in intelligence aggregation DLQ (stage)"
      + alarm_name                            = "marketplace-intelligence-aggregation-dlq-stage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "stage-marketplace-intelligence-aggregation-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.intelligence_description_analysis_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "intelligence_description_analysis_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in intelligence description analysis DLQ (stage)"
      + alarm_name                            = "marketplace-intelligence-desc-analysis-dlq-stage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "stage-marketplace-intelligence-description-analysis-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.intelligence_notice_analysis_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "intelligence_notice_analysis_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in intelligence notice analysis DLQ (stage)"
      + alarm_name                            = "marketplace-intelligence-notice-analysis-dlq-stage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "stage-marketplace-intelligence-notice-analysis-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.intelligence_option_analysis_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "intelligence_option_analysis_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in intelligence option analysis DLQ (stage)"
      + alarm_name                            = "marketplace-intelligence-option-analysis-dlq-stage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "stage-marketplace-intelligence-option-analysis-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.intelligence_orchestration_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "intelligence_orchestration_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in intelligence orchestration DLQ (stage)"
      + alarm_name                            = "marketplace-intelligence-orchestration-dlq-stage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "stage-marketplace-intelligence-orchestration-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_policy.sqs_access will be updated in-place
~ resource "aws_iam_policy" "sqs_access" {
        id               = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"
        name             = "marketplace-sqs-access-stage"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:GetQueueUrl",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-scoring",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-scoring-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-enhancement",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-enhancement-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-verification",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-verification-dlq",
                        ]
                      - Sid      = "SQSAccess"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294",
                        ]
                      - Sid      = "KMSDecrypt"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "cost_center"  = "engineering"
            "data_class"   = "internal"
            "environment"  = "stage"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "marketplace"
            "service_name" = "marketplace-sqs"
            "team"         = "platform-team"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.intelligence_aggregation will be created
+ resource "aws_sqs_queue" "intelligence_aggregation" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-aggregation"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-aggregation"
          + "Purpose"      = "Final analysis aggregation and decision"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-aggregation"
          + "Project"      = "marketplace"
          + "Purpose"      = "Final analysis aggregation and decision"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.intelligence_aggregation_dlq will be created
+ resource "aws_sqs_queue" "intelligence_aggregation_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "stage-marketplace-intelligence-aggregation-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-aggregation-dlq"
          + "Purpose"      = "DLQ for intelligence aggregation"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-aggregation-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "DLQ for intelligence aggregation"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.intelligence_description_analysis will be created
+ resource "aws_sqs_queue" "intelligence_description_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-description-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-description-analysis"
          + "Purpose"      = "Description text AI analysis (Sonnet)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-description-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Description text AI analysis (Sonnet)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 600
    }

  # aws_sqs_queue.intelligence_description_analysis_dlq will be created
+ resource "aws_sqs_queue" "intelligence_description_analysis_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "stage-marketplace-intelligence-description-analysis-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-description-analysis-dlq"
          + "Purpose"      = "DLQ for description analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-description-analysis-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "DLQ for description analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.intelligence_notice_analysis will be created
+ resource "aws_sqs_queue" "intelligence_notice_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-notice-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-notice-analysis"
          + "Purpose"      = "Notice completion analysis (Haiku)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-notice-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Notice completion analysis (Haiku)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.intelligence_notice_analysis_dlq will be created
+ resource "aws_sqs_queue" "intelligence_notice_analysis_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "stage-marketplace-intelligence-notice-analysis-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-notice-analysis-dlq"
          + "Purpose"      = "DLQ for notice analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-notice-analysis-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "DLQ for notice analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.intelligence_option_analysis will be created
+ resource "aws_sqs_queue" "intelligence_option_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-option-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-option-analysis"
          + "Purpose"      = "Canonical option mapping analysis (Haiku)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-option-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Canonical option mapping analysis (Haiku)"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.intelligence_option_analysis_dlq will be created
+ resource "aws_sqs_queue" "intelligence_option_analysis_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "stage-marketplace-intelligence-option-analysis-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-option-analysis-dlq"
          + "Purpose"      = "DLQ for option analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-option-analysis-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "DLQ for option analysis"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.intelligence_orchestration will be created
+ resource "aws_sqs_queue" "intelligence_orchestration" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-orchestration"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-orchestration"
          + "Purpose"      = "ProductProfile creation and analyzer dispatch"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-orchestration"
          + "Project"      = "marketplace"
          + "Purpose"      = "ProductProfile creation and analyzer dispatch"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # aws_sqs_queue.intelligence_orchestration_dlq will be created
+ resource "aws_sqs_queue" "intelligence_orchestration_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "stage-marketplace-intelligence-orchestration-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-orchestration-dlq"
          + "Purpose"      = "DLQ for intelligence orchestration"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-orchestration-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "DLQ for intelligence orchestration"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_ssm_parameter.intelligence_aggregation_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_aggregation_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-aggregation-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_description_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_description_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-description-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_notice_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_notice_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-notice-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_option_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_option_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-option-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_orchestration_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_orchestration_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-orchestration-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 20 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ intelligence_aggregation_queue_url          = (known after apply)
+ intelligence_description_analysis_queue_url = (known after apply)
+ intelligence_notice_analysis_queue_url      = (known after apply)
+ intelligence_option_analysis_queue_url      = (known after apply)
+ intelligence_orchestration_queue_url        = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-stage
  ```
Plan: 20 to add, 1 to change, 0 to destroy.

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```